# Autosortering av excel data

In [38]:
import pandas as pd
import os
import glob
import datetime
import openpyxl as wb
import numpy as np

In [39]:
 today = datetime.date.today()
 first = today.replace(day=1)
 last_month = first - datetime.timedelta(days=1)
 month01 = last_month.strftime("%m%y")
month01

'0423'

In [73]:
df = pd.read_excel("data_inn/bedrift.xlsx")

/tmp/ipykernel_682/2887116124.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.replace('$', '')

In [115]:
x=len(df.columns)

In [116]:
alphabet=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

In [ ]:
df.columns = ['V', 'W', 'X', 'Y', 'Z']

In [118]:
x=len(df.columns)
y = alphabet[0:x]
df.columns = y

['a', 'b']

In [119]:
df.columns = y

In [120]:
df

           a     b
0        NaN   NaN
1        NaN   NaN
2   avdeling   oms
3          2  1360
4          3   850
5          4   781
6          8   960
7          9   750
8          5  1640
9          6  1112
10         7  1278
11        10   789
12         1  1220

In [41]:
df_rev = pd.read_excel("data_rev/bedrift_rev.xlsx")
df_rev

          orgnr     nace   avd    0323
0           NaN      NaN   NaN     NaN
1           NaN      NaN   NaN     NaN
2           NaN      NaN   NaN     NaN
3   999999998.0  47400.0   1.0  1250.0
4   999999997.0  47400.0   2.0  1112.0
5   999999996.0  47400.0   3.0  1691.0
6   999999995.0  47400.0   4.0   892.0
7   999999994.0  47400.0   5.0   789.0
8   999999993.0  47400.0   6.0   985.0
9   999999992.0  47400.0   7.0   684.0
10  999999991.0  47400.0   8.0  1340.0
11  999999990.0  47400.0   9.0  1955.0
12  999999989.0  47400.0  10.0   852.0

## Speilet loop for å sjekke at alt fungerer uansett rekkefølge

In [141]:
for (columnName, columnData) in df.iteritems():
    if df[columnName].dropna().isin(df_rev['avd']).any() == True:
            columnRight=columnName
            columnLeft='avd'
    elif df[columnName].dropna().isin(df_rev['orgnr']).any() == True:
            columnRight=columnName
            columnLeft='orgnr'

In [138]:
for (columnName, columnData) in df.iteritems():
    if df[columnName].dropna().isin(df_rev['orgnr']).any() == True:
            columnRight=columnName
            columnLeft='orgnr'
    elif df[columnName].dropna().isin(df_rev['avd']).any() == True:
            columnRight=columnName
            columnLeft='avd'

In [139]:
columnRight

'a'

In [143]:
columnLeft

'avd'

In [144]:
df_rev.columns = [*df_rev.columns[:-1], month01]
df_rev

          orgnr     nace   avd    0423
0           NaN      NaN   NaN     NaN
1           NaN      NaN   NaN     NaN
2           NaN      NaN   NaN     NaN
3   999999998.0  47400.0   1.0  1250.0
4   999999997.0  47400.0   2.0  1112.0
5   999999996.0  47400.0   3.0  1691.0
6   999999995.0  47400.0   4.0   892.0
7   999999994.0  47400.0   5.0   789.0
8   999999993.0  47400.0   6.0   985.0
9   999999992.0  47400.0   7.0   684.0
10  999999991.0  47400.0   8.0  1340.0
11  999999990.0  47400.0   9.0  1955.0
12  999999989.0  47400.0  10.0   852.0

In [146]:
df_ut = df_rev[['orgnr',month01]]
df_ut

          orgnr    0423
0           NaN     NaN
1           NaN     NaN
2           NaN     NaN
3   999999998.0  1250.0
4   999999997.0  1112.0
5   999999996.0  1691.0
6   999999995.0   892.0
7   999999994.0   789.0
8   999999993.0   985.0
9   999999992.0   684.0
10  999999991.0  1340.0
11  999999990.0  1955.0
12  999999989.0   852.0

In [9]:
df_ut.to_excel("df_ut.xlsx", index = False)